[
    {
        "id": 1,
        "JobTitle": "C++ Backend Developer",
        "Company": "Volue Sp. z o.o.",
        "Url": "https://nofluffjobs.com/job/c-backend-developer-volue-gdansk",
        "Description": "C++ Backend Developer Volue Sp. z o.o. technology image Category: Backend , C++ Mid Must have C++English (B2) Nice to have PythonC#Polish Requirements description C++ programming experience and knowledge of modern C++ Familiarity with Microsoft platform and tools is beneficial Experience working in larger C++ codebases Experience working effectively in a distributed team Some experience with using databases Some knowledge of Python and C# Offer description Volue is a market leader in technologies and services that power the green transition. Around 800 employees work with more than 2 200 customers on energy, power grid, water & infrastructure projects.Our mission is to provide innovative services critical to society, unlocking a cleaner, better and more profitable future. Working towards this goal, Volue has become a leading technology supplier and enabler of the green transition, helping energy companies simplify and optimize everyday operations.We are now looking for Mid/Senior Software Engineer (Mesh Team), who can help us to continuously improve Volue’s ability to provide value to customers in line with the Volue mission. Volue Mesh is a data management system based on object modelling with an integrated time series calculation engine. It is used for more efficient managing of time series data and related information used in different work processes and serves as the core of all future energy production planning and trading solutions.read more Your responsibilities Contribute to all development phases: design, develop, build, deploy and maintain the C++ codebase of Volue Mesh Work closely together with architects, domain experts and backend developers Create and maintain user friendly solutions with clear APIs with efficient resource usage and high performance Work in an international environment, where English is the spoken and written language. The team is distributed in Gdańsk and Trondheim Work in a distributed team with a flexible work-from-home policy Work closely with data intensive applications that are using Mesh and Time Series Management systems to simplify complex workflows show all (7) Job details Online recruitment Recruitment language: Polish&English Start ASAP Permanent contract Remote days: flexible in a week Flexible hours Relocation package: 6000 PLN Perks in the office Free snacks Free coffee Free beverages Gym Canteen Bike parking Playroom Shower No dress code Benefits Sport subscription Life & group insurance Private healthcare English classes Training budget Flat structure Small teams International projects"
    },

    {
        "id": 2,
        "JobTitle": "Frontend Developer / Mentor - Part-time",
        "Company": "Mate academy",
        "Url": "https://nofluffjobs.com/pl/job/frontend-developer-mentor-part-time-mate-academy-remote?lang=en",
        "Description": "Frontend Developer / Mentor - Part-time Mate academy technology image Category: Frontend ,  JavaScript Mid Must have JavaScriptPolish (C2)English (B1) Requirements description at least 1.5 year of commercial experience as a Frontend Developer; ability and love to communicate with people and help them solve problems; good time management and ability to organize your own schedule independently. Offer description practice of your soft skills mentoring is a great way to grow to Senior positions faster; a team that will help you cope with any difficulties Selection stages: send CV; complete a test task; pass the final interview, which will include HR and technical parts. Hourly pay (12-20$/h) and a flexible schedule: your mentoring week will include 10+ hours of work that you can spread out over the week. We reserve the right to contact only selected candidates. read more Your responsibilities Checking homework of students of the Frontend course; Answering students' questions in chat and on zoom calls; Conducting mock technical interviews for students; Suggestions for improving the learning process. Job details Online recruitment Recruitment language: English Start ASAP Permanent contract Fully remote Flexible hours FTE in hours: 10+/week"
    },

    {
        "id": 3,
        "JobTitle": "Medior Data Scientist",
        "Company": "NIX Tech Kft.",
        "Url": "https://nofluffjobs.com/pl/job/medior-data-scientist-nix-tech-kft--budapest?lang=en",
        "Description": "Medior Data Scientist NIX Tech Kft. technology image Category: Data Mid Must have Data scienceMachine learningSQLNumPypandasMatplotXGBoostLightGBMTensorFlowPyTorchPythonGitOOPMachine Learningscikit-learnEnglish (B1) Requirements description English level upper intermediate+ Good mathematical and statistical background, tensor calculus Good knowledge of databases such as Postgres, MongoDB, and SQL Python language including practical experience with Scikit-learn, Numpy, Pandas, and Matplot libraries Experience with gradient boosting algorithms (XGBoost or LightGBM) At least 1 framework to build and train neural networks (TensorFlow/Keras, PyTorch), a good understanding of neural networks architectures, and how-tos Commercial experience with classic machine learning and deep learning, including NLP and CV models like Bert, Resnet Practical skills in building en-to-end ML training pipelines (data load, preprocess, train, inference), as well as GitHub / GitLab CI/CD flows Docker or Kubernetes platform WILL BE A PLUS: Experience working with AWS or Azure Ability to work with Spark, Airflow read more Offer description NIX Tech, a global supplier of software engineering and IT outsourcing services, is looking for a Junior Data Scientist in its office in Budapest (Vaci Green, 13th district). You’ll be part of a team of professionals who are ready to find the best tailor-made IT solutions for their multinational clients in various industries and solve complex problems. If you feel you’re ready to join the team, apply for this job now! We’re already looking forward to meeting you! Your responsibilities Be a proactive team member Collaborate with the team to implement new features to support the growing data needs Build, maintain, and deploy DS and ML pipelines, including data retrieval, preprocessing, feature engineering, training, and inferencing the models, analyzing and visualizing the results Share knowledge with other teams on various data science or project-related topics Collaborate with the team to decide on which tools and strategies to use within specific scenarios. Job details Recruitment language: English Start ASAP Permanent contract Paid holiday for: Employment contract No remote work Equipment supplied  Windows  Perks in the office Free coffee Bike parking Free snacks Modern office No dress code "
    },

    {
        "id": 4,
        "JobTitle": "Senior SQL Developer",
        "Company": "GGS IT CONSULTING",
        "Url": "https://nofluffjobs.com/pl/job/senior-sql-developer-ggs-it-consulting-krakow-1?lang=en",
        "Description": "Senior SQL Developer GGS IT CONSULTING technology image Category: Data ,  SQL Senior Must have SQLGitETLEnglish (B2) Nice to have Azure DevOps Requirements description Min. 4 years of experience in a similar position; SQL programming knowledge (expert); Experience in GIT; Experience in designing ETL processes and software implementation; English knowledge (B2/C1 level) is a must; High communication skills - Consulting approach; Teamwork skills, good organization, planning, and a positive attitude. Nice to have: Experience in Microsoft Data Tools (SSDT) Experience in Azure DevOps Pipelines Offer description We are a passionate group of people who enjoy their daily challenges. We support our clients within the scope of a software implementation and business intelligence. We  are looking for like minded individuals who share the same passion, values and enthusiasm. Blend of the above is the way to customer’s success. We take pride in our diverse business experience. Continuous cooperation with customers as different as financial institutions, automotive companies or telecom companies proves our ability to translate business needs into software that one can immediately work with to improve efficiency. Working for us means that you’ll have a chance to shape the company’s future as we value everyone's input. We are now looking for a Senior SQL Developer for one of our existing projects. Our team is responsible for the implementation and application maintenance of the client’s platform for their global customers.  read more Your responsibilities Designing and creating databases for computer systems;  Designing, building, and optimizing ETL processes and SQL procedures;  Gathering requirements from customers;  Proposing business solutions for customers’ needs;  Preparing a necessary technical specification;  Planning next releases, scoping the implementation;  show all (9) Job details Online recruitment Recruitment language: English Start ASAP Permanent contract Paid holiday for: Employment contract Remote days: flexible in a week Flexible hours Equipment supplied  Windows   Computer: Notebook   Monitors: Two  Methodology Tester(s) Agile management Issue tracking tool Jira Knowledge repository Confluence Version control system GIT Perks in the office Free coffee Bike parking Shower Free snacks Free parking In-house trainings Free breakfast Startup atmosphere Benefits Private healthcare Small teams International projects English lessons Sport subscription Flat structure"
    },

    {
        "id": 5,
        "JobTitle": "Senior Machine Learning Engineer",
        "Company": "Secret Sauce Partners, Inc.",
        "Url": "https://nofluffjobs.com/pl/job/senior-machine-learning-engineer-secret-sauce-partners-remote-1?lang=en",
        "Description": "Senior Machine Learning Engineer Secret Sauce Partners, Inc. technology image Category: AI ,  Python Senior Must have Machine learningBacktestingFeature EngineeringCollaborative codingData visualizationPythonEnglish Nice to have AWSPySParkNLPDatabricksGitHubToolingA/B testing Requirements description As a senior member of a small team, you will have a great influence on the design of SSP’s products. Accordingly, we are looking for someone with hands-on experience building production machine-learning solutions from the ground up. In particular, your experience should include typical data science tasks (e.g. idea generation, data manipulation, modeling, model comparison, etc.) as well as basic engineering (e.g. writing clear maintainable code, building data or feature engineering pipelines, maintaining scripts and tooling to support ML tasks and deployments, performing predictions at scale, etc.). We appreciate if you have the following  experiences Strong background in machine learning and related programming (preferably in Python) Hands-on experience productionizing machine learning models/pipelines and a solid understanding of best practices Experience with feature engineering and common machine learning algorithms (e.g. Regression, GBM, ANNs, etc.) including knowledge of hyperparameter tuning, regularization, etc. Familiarity with general backtesting strategies as well as time-series-specific techniques Strong programming background including collaborative coding with version control, unit, and integration testing A deep understanding of the utility and limitations of various model evaluation metrics for both online and offline environments Ability to stay up to date with ML techniques and libraries and to acquire any missing technical skills concurrently while executing on projects Basic data visualization experience to support explanations of problems/solutions The soft skills that we think are important Clearly explain problems, present solutions, and debate strategies in English to both technical and non-technical audiences Understand a business problem, then propose and weigh multiple solutions Collaborate effectively with Data Scientists, Engineers, and Product Team members Estimate and plan machine learning projects and coordinate with engineering team members Bonus points Advanced training in ML, Statistics, CS, or a related discipline (Masters, PhD preferred) Experience with A/B testing as a form of model evaluation Hands-on experience with PySpark and/or Databricks Experience handling unstructured text and/or NLP methodology Experience building tooling, scripts (e.g. bash, python, etc), or systems to support ML investigations, deployments, etc. Monitoring production model performance using automated dashboards or data visualization You are active on GitHub and have contributed to open-source projects read more Offer description As a Senior Machine Learning Engineer, you will be responsible for developing and maintaining the fit and sizing models that form the backbone of our services. Our product offerings, powered by machine learning, are integrated into the largest fashion and apparel e-commerce stores in the US and Europe and provide shopping experiences that revolutionize online commerce. Your work will directly impact our 50+ million users and ensure their happiness. We are looking for someone who is ready to tackle any/all parts of the machine learning pipeline. In this role, you will analyze large sets of behavioral and product attribute data from data preparation to productionizing ML models and prediction. You will propose novel ML and sometimes non-ML solutions to business problems, develop, test, and present your solutions. Your responsibilities will also include productionizing data preparation, modeling, prediction, and monitoring. Who you'll be working with A small, but clever team of data scientists, who design new products from scratch Our leadership and product team members who will provide you with an unlimited supply of exciting challenges to tackle Our highly capable engineering team that maintains robust scalable data pipelines and supports low latency prediction serving The majority of our team is located in Budapest, Hungary, but you'll be able to work remotely anywhere in the EU.  read more Your responsibilities Participate in product discussions, propose and test solutions to business problems Design, build and maintain production machine learning models and pipelines Work closely with data and backend engineers to serve predictions, support new products/features, etc. Job details Online recruitment Recruitment language: English Start ASAP Permanent contract Paid holiday for: B2B (+1) B2B Employment contract Fully remote Flexible hours No travel involved Mainly new features Equipment supplied  Apple   Computer: Notebook   Monitors: If needed  Methodology Agile management Agile Issue tracking tool Jira Knowledge repository Google Docs Cloud infrastructure AWS, Google Cloud Operating system Linux, macOS Version control system GIT Code reviews GitHub Build server CircleCI Freedom to choose tools Perks in the office Startup atmosphere No dress code Benefits Flat structure Small teams"
    },

    {
        "id": 6,
        "JobTitle": "Deep Learning Engineer",
        "Company": "Focal Systems",
        "Url": "https://nofluffjobs.com/pl/job/deep-learning-engineer-focal-systems-remote?lang=en",
        "Description": "Deep Learning Engineer Focal Systems technology image Category: AI ,  Python Mid Must have PythonMachine learningTensorFlowKerasPhDPyTorchEnglish (B2) Nice to have Cloud Requirements description Masters or PhD in CS / EE or equivalent with stellar academic performance Have significant experience training Convolutional Neural Networks (CNNs) Experience with Keras (Tensorflow) / Pytorch 2+ years Training Deep Learning Computer Vision (DL CV) applications in a corporate environment Startup mentality, team player and willing to work 40+ hours a week Published research in peer-reviewed journal a huge plus! Offer description Note: salary level includes the value of stock options. Total Comp depending on published papers / # of citations / h-index. Focal Systems is the industry leader in retail AI solutions. We are a Silicon Valley based startup that has more than doubled in size every year since inception. We are a Deep Learning first company. Our mission is to automate and optimize brick and mortar retail using deep learning computer vision. Focal Systems has been deployed at scale with the top retailers in the world. We are looking for smart, creative and passionate people who want to help build a great and enduring company and deploy Deep Learning to the world! We have a very strong team of remote Engineers in Poland who work as B2B Contractors. We invite you to join the team! We are looking for a versatile DL/CV engineer who has demonstrated capabilities to develop, benchmark, and validate a wide variety of deep neural network architectures to extract knowledge and information from images in real-time. read more Your responsibilities Develop state-of-the-art and novel deep neural network architectures Develop training & testing pipelines to assess the performance of architectures on relevant image processing tasks Keep up with deep learning literature and research publications in order to implement the latest techniques into our networks and pipelines Develop machine-learning algorithms on a breadth of software frameworks (Keras, TensorFlow, Torch) and deploy on a diversity of hardware platforms Job details Recruitment language: English Start ASAP Permanent contract Paid holiday for: B2B Fully remote Flexible hours Some travel involved Methodology Agile management Knowledge repository Confluence Cloud infrastructure Operating system Linux, Windows, macOS Version control system GIT Perks in the office Startup atmosphere No dress code Benefits Training budget Flat structure Small teams International projects Stock options"
    },

    {
        "id": 7,
        "JobTitle": "Intern - Computer Vision, LLM",
        "Company": "TCL Research Europe Sp. z o.o.",
        "Url": "https://nofluffjobs.com/pl/job/intern-computer-vision-llm-tcl-research-europe-warsaw?lang=en",
        "Description": "Intern - Computer Vision, LLM TCL Research Europe Sp. z o.o. technology image Category: AI ,  Python Junior Must have PythonMachine LearningComputer visionEnglishPolish Nice to have Deep LearninggitLinux Requirements description Should have Strong programming skills (Python) Theoretical background in ML/DL Interest in Computer Vision or LLMs (preferably text to image, text to video, LLM prompting) Nice to have Experience in using Linux, git Good command of English, both written and spoken Ongoing MSc/PhDs studies in the area of AI Offer description TCL Research Europe is an R&D center focused on creating Artificial Intelligence and Cloud solutions for global products of TCL, a leading consumer electronics company with 120 000 employees across 78 countries, ranked n°2 worldwide TV producer. Whether you are an MSc or a PhD student, join us to gain practical knowledge from AI experts as you work on an innovative project that will extend the new TCL video streaming platform with unique AI-powered features and introduce interactive TV viewing experience. Your responsibilities Research and validate currently available solutions, both commercial and opensource Prototype and implement solutions using existing LLM, text-to-image, text-to-video technologies Collaborate with other team members and research institutes Job details Online recruitment Recruitment language: English&Polish Start ASAP Contract for 6 months Remote days: flexible in a week Flexible hours Mainly new features Equipment supplied  Linux   Apple   Windows   Computer: Notebook   Monitors: Two  Methodology Knowledge repository Confluence, GitLab Operating system Linux, Windows, macOS Perks in the office Free coffee Bike parking Playroom Shower Free snacks Free beverages Free parking No dress code Modern office Benefits International projects Sport subscription Private healthcare Small teams"
    },

    {
        "id": 8,
        "JobTitle": "Senior Full Stack Engineer (React/.NET)",
        "Company": "N-iX",
        "Url": "https://nofluffjobs.com/pl/job/senior-full-stack-engineer-react-net-n-ix-remote?lang=en",
        "Description": "Senior Full Stack Engineer (React/.NET) N-iX technology image Category: Fullstack ,  React Senior Job offer with support for refugees The employer provides additional facilitations and support for refugees due to the situation in Ukraine. These cover one or more of the following options: recruitment in Ukrainian accelerated recruitment process relocation package psychological assistance other, depending on the particular employer and candidate Must have ReactHTMLSCSSCSSTypeScript.NETEnglish (B2) Requirements description BS degree in Computer Science or equivalent combination of education and experience 3+ years of experience as a full-stack development 3+ years of experience in the following technologies: React, HTML, SCSS/CSS, TypeScript/JavaScript, SQL/Oracle DB, .NET Nice to have 1+ years of experience with the following: CMS knowledge , Ionic, DevOps/Windows/Linux/Jenkins Knowledge of UX and UI methodology Versatility and capability to switch easily between different tasks and technologies Experience in assessing a broad range of information solutions and products Strong critical thinker with a problem-solving attitude Fluent in English - verbal and written Offer description Flexible working format - remote, office-based or flexible A competitive salary and good compensation package Flexible and personalized career growth Professional development tools (mentorship program, tech talks and training, centers of excellence, and more) Active tech communities with regular knowledge sharing Education reimbursement Paid vacation days, sick leaves, and days off Memorable anniversary presents Corporate events and team buildings Your responsibilities Design and develop Web applications Responsible for performing required tasks accurately, thoughtfully, and conscientiously within the agreed timeline-SLA Develop from specifications supplied or creates your own specification based on requirements. Reports progress on a regular basis to Team Leader Responsible for planning daily schedules and efficient use of time to ensure deliverables are met Responsible for unit testing of own code to a level acceptable for Quality Assurance testing, where basic functions work per the requirements Job details Recruitment language: Polish Start ASAP Permanent contract Paid holiday for: B2B (+1) B2B Employment contract Fully remote Flexible hours Equipment supplied  Apple   Windows   Computer: Notebook   Monitors: If needed  Methodology Agile management Code reviews Perks in the office Free coffee Modern office Kitchen Friendly atmosphere Benefits Training budget International projects Paid vacations Paid sick leaves Flexible working hours and remote work possibility Medical insurance Life insurence Mentoring program English lessons Compensation of certification Cafeteria Active tech community Referral program"
    },

    {
        "id": 9,
        "JobTitle": "Remote React Native Developer",
        "Company": "DataArt",
        "Url": "https://nofluffjobs.com/pl/job/remote-react-native-developer-dataart?lang=en",
        "Description": "Remote React Native Developer DataArt technology image Category: Frontend ,  React Senior Must have ReactReact NativeReduxPolishEnglish Requirements description Strong knowledge and experience with React Native Experience with Redux Understanding of Agile methodologies Good communication and business relationship-building skills Spoken English Offer description The client is the largest American company that deals with health protection. This company serves more than 8 million patients. In addition to medical institutions, it includes institutes that conduct clinical studies. Thanks to this, over the past 20 years, the quality of medical care has been steadily increasing. The client is the largest American company that deals with health protection. This company serves more than 8 million patients. In addition to medical institutions, it includes institutes that conduct clinical studies. Thanks to this, over the past 20 years, the quality of medical care has been steadily increasing. Technology stack React Native Redux GraphQL Gigya SDK Application Insights read more Your responsibilities Establish new user-facing features Build reusable code and libraries for future use Guarantee the technical feasibility of UI/UX designs Enhance applications for best speed and scalability Assure that all user input is validated before submitting to back-end services Cooperate with other team members and stakeholders Job details Online recruitment Recruitment language: Polish&English Start ASAP Permanent contract Paid holiday for: B2B Fully remote Flexible hours No travel involved Equipment supplied  Windows   Computer: Notebook   Monitors: If needed  Perks in the office Free coffee Gym Canteen Bike parking Playroom Shower Free snacks Free beverages Modern office Startup atmosphere No dress code In-house trainings Benefits Sport subscription Training budget Private healthcare Flat structure Lunch card Small teams International projects 26 days of paid holidays for everyone"
    }
]